Revit 2026 API

# FilteredWorksetCollectorFirstWorkset Method

---

Returns the first workset to pass the filter(s).

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public Workset FirstWorkset()
```
```vb
Public Function FirstWorkset As Workset
```
```cpp
public:
Workset^ FirstWorkset()
```
```fsharp
member FirstWorkset : unit -> Workset
```

#### Return Value

Workset The first workset.

| Exception | Condition |
| --- | --- |
| InvalidOperationException | The collector does not have a filter applied. Extraction or iteration of worksets is not permitted without a filter. |

This will reset the collector to the beginning and find the first workset that passes the applied filter(s). If you have an active iterator to this same collector it will be stopped by this call.

#### Reference

FilteredWorksetCollector Class

Autodesk.Revit.DB Namespace